# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
ch: 4

#yolov5s
depth_multiple: 0.33
width_multiple: 0.50

#yolov5m
#depth_multiple: 0.67
#width_multiple: 0.75

#yolov5l
# depth_multiple: 1
# width_multiple: 1

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1, 1]],  # 0
   [-1, 1, nn.MaxPool2d, [2, 2, 0]], # 1
   [-1, 1, Conv, [64, 3, 1, 1]],  # 2
   [-1, 1, nn.MaxPool2d, [2, 2, 0]], # 3
   [-1, 1, Conv, [128, 3, 1, 1]], # 4
   [-1, 1, nn.MaxPool2d, [2, 2, 0]], # 5
   [-1, 1, Conv, [256, 3, 1, 1]], # 6
   [-1, 1, nn.MaxPool2d, [2, 2, 0]], # 7
   [-1, 1, Conv, [256, 3, 1, 1]], # 8
   [-1, 1, GlobalMaxPool2d, []],  # 9
   [7, 1, EmptyModule, []],      # 10 route
   [-1, 1, Conv, [512, 3, 1, 1]], # 11
   [-1, 1, nn.MaxPool2d, [2, 2, 0]], # 12
   [-1, 1, Conv, [512, 3, 1, 1]], # 13
   [-1, 1, GlobalMaxPool2d, []],  # 14
   [12, 1, EmptyModule, []],     # 15 route
   [-1, 1, Conv, [1024, 3, 1, 1]],# 16
   [-1, 1, nn.MaxPool2d, [2, 2, 0]], # 17
   [-1, 1, Conv, [1024, 3, 1, 1]],# 18
   [-1, 1, GlobalMaxPool2d, []],  # 19
  ]

## YOLOv5 v6.0 head
#head:
#  [[-1, 1, Conv, [512, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
#   [-1, 3, C3, [512, False]],  # 13
#
#   [-1, 1, Conv, [256, 1, 1]],
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
#   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
#   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)
#
#   [-1, 1, Conv, [256, 3, 2]],
#   [[-1, 14], 1, Concat, [1]],  # cat head P4
#   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)
#
#   [-1, 1, Conv, [512, 3, 2]],
#   [[-1, 10], 1, Concat, [1]],  # cat head P5
#   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)
#
#   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
#  ]
